def area(a: float, b: float) -> float:
    '''
    Возращает площадь прямоугольника по заданным сторонам.
    
    Параметры:
        a(float) - первая сторона прямоугольника
        b(float) - вторая сторона прямоугольника
        
    Возращаемое значение:
        (float) - площадь прямоугольника
    
    '''
    return a*b

def perimeter(a: float, b: float) -> float:
    '''
    Возращает периметр прямоугольника по заданным сторонам.
    
    Параметры:
        a(float) - первая сторона прямоугольника
        b(float) - вторая сторона прямоугольника
            
    Возращаемое значение:
        (float) - периметр прямоугольника
        
    '''
    return 2 * (a + b)