def area(a: float) -> float:
    ''' 
        Возращает площадь квадрата по заданной стороне.
           
        Параметры:
            a(float) - сторона квадрата
        
        Возращаемое значение:
            (float) - площадь квадрата
         
    '''
    return a**2


def perimeter(a: float) -> float:
    ''' 
        Возращает периметр квадрата по заданной стороне.
           
        Параметры:
            a(float) - сторона квадрата
        
        Возращаемое значение:
            (float) - площадь квадрата
         
    '''
    return 4*a